## Subqueries

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db1.db

'Connected: @db1.db'

In [3]:
%sql select name from sqlite_master where type = 'table';

 * sqlite:///db1.db
Done.

[('cities',),
 ('countries',),
 ('countries_plus',),
 ('currencies',),
 ('economies',),
 ('economies2010',),
 ('economies2015',),
 ('languages',),
 ('populations',)]

In [5]:
%sql select * from populations limit 1;

 * sqlite:///db1.db
Done.

[(20, 'ABW', 2010, 1.704, 74.95353658536591, 101597)]

Calc avg life expectancy

In [6]:
%sql select avg(life_expectancy) from populations where year = 2015

 * sqlite:///db1.db
Done.

[(71.67634158659767,)]

Select populations with avg life exp 15 percent higher than avg

In [7]:
%%sql
select * from populations
where life_expectancy > 
1.15 * (select avg(life_expectancy) from populations
where year = 2015) and year = 2015

 * sqlite:///db1.db
Done.

[(21, 'AUS', 2015, 1.8330000000000002, 82.4512195121951, 23789752),
 (376, 'CHE', 2015, 1.54, 83.1975609756098, 8281430),
 (356, 'ESP', 2015, 1.32, 83.38048780487809, 46443994),
 (134, 'FRA', 2015, 2.01, 82.67073170731709, 66538391),
 (170, 'HKG', 2015, 1.195, 84.2780487804878, 7305700),
 (174, 'ISL', 2015, 1.93, 82.8609756097561, 330815),
 (190, 'ITA', 2015, 1.37, 83.490243902439, 60730582),
 (194, 'JPN', 2015, 1.46, 83.84365853658541, 126958472),
 (340, 'SGP', 2015, 1.24, 82.5951219512195, 5535002),
 (374, 'SWE', 2015, 1.88, 82.55121951219509, 9799186)]

Get the urban area population for only capital cities.

In [8]:
%sql select * from countries limit 1;

 * sqlite:///db1.db
Done.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Kabul', 69.1761, 34.5228)]

In [9]:
%sql select * from cities limit 1;

 * sqlite:///db1.db
Done.

[('Abidjan', 'CIV', 4765000, None, 4765000)]

In [11]:
%%sql
select name,country_code,urbanarea_pop from cities
where name in (select capital from countries)
order by urbanarea_pop desc
limit 5;

 * sqlite:///db1.db
Done.

[('Beijing', 'CHN', 21516000),
 ('Dhaka', 'BGD', 14543124),
 ('Tokyo', 'JPN', 13513734),
 ('Moscow', 'RUS', 12197596),
 ('Cairo', 'EGY', 10230350)]

Select top 9 most populous cities

In [13]:
%%sql
SELECT countries.country_name AS country,
  (SELECT COUNT(*)
   FROM cities
   WHERE countries.code = cities.country_code) AS cities_num
FROM countries
ORDER BY cities_num DESC, country
LIMIT 9;

 * sqlite:///db1.db
Done.

[('China', 36),
 ('India', 18),
 ('Japan', 11),
 ('Brazil', 10),
 ('Pakistan', 9),
 ('United States', 9),
 ('Indonesia', 7),
 ('Russian Federation', 7),
 ('South Korea', 7)]

Determine for each country code how many languages are listed in the languages table using SELECT, FROM, and GROUP BY

In [15]:
%%sql
SELECT code, COUNT(*) AS lang_num
FROM languages
GROUP BY code
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 7), ('AFG', 4), ('AGO', 12), ('AIA', 1), ('ALB', 4)]

Determine the number of languages spoken for each country, identified by the country's local name

In [17]:
%%sql
SELECT local_name, subquery.lang_num
FROM countries,
(SELECT code, COUNT(*) AS lang_num
FROM languages
GROUP BY code) AS subquery
WHERE countries.code = subquery.code
ORDER BY lang_num DESC
limit 5;

 * sqlite:///db1.db
Done.

[('Zambia', 19),
 ('YeItyop´iya', 16),
 ('Zimbabwe', 16),
 ('Bharat/India', 14),
 ('Nepal', 14)]